import { Box } from '@mui/material';
import SectionTitle from './SectionTitle';
import CanvasAccordion from './CanvasAccordion';

const AccordionContent = [
    {
      title: 'Чому варто обрати автоматичні ворота для мого будинку?',
      description: 'Автоматичні ворота забезпечують зручність та безпеку для вашого будинку. Ви зможете легко керувати воротами з допомогою пульта дистанційного управління, що забезпечить вам комфорт і захист.'
    },
    {
      title: 'Яка сучасна автоматика для воріт найбільш надійна?',
      description: 'Наша автоматика для воріт використовує передові технології, що забезпечують максимальну надійність та довгий термін служби. Ви можете бути впевнені в безпеці та комфорті на кожен день.'
    },
    {
      title: 'Які переваги надають шлагбауми на парковках?',
      description: 'Шлагбауми на парковках забезпечують контроль та безпеку. Вони дозволяють ефективно регулювати рух транспорту та обмежити доступ незаконним особам. Це допоможе забезпечити порядок та захист на вашій парковці.'
    },
    {
      title: 'Які опції доступні для автоматизації воріт та шлагбаумів?',
      description: 'Ми пропонуємо різноманітні опції автоматизації для воріт та шлагбаумів. Ви можете вибрати систему з радіопультом, WiFi-модулем, або іншими функціями, що задовольнять ваші потреби та бюджет.'
    },      
    {
      title: 'Який час потрібен для встановлення автоматичних шлагбаумів?',
      description: 'Наша команда професіоналів забезпечить швидку та якісну установку автоматичних шлагбаумів. Ми розуміємо цінність вашого часу і гарантуємо ефективне виконання замовлення.'
    },
    {
      title: 'Чи надаєте ви гарантію на встановлені системи?',
      description: 'Так, ми надаємо гарантію на наші встановлені системи автоматизації. Ви можете бути спокійні, знаючи, що ми завжди стоїмо за якість наших послуг.'
    }
]
const MotorFAQ = () => {
    return (
        <Box>
            <SectionTitle title='Frequently Asked' colored='Questions'></SectionTitle>
            <Box sx={{
                mt: 3,
                display: 'flex',
                flexDirection: 'column',
                gap: 2
            }}>
                {
                  AccordionContent.map(
                    (Content, index) => <CanvasAccordion key={index} Content={Content} />
                    )
                }
            </Box>
        </Box>
    );
};
export default MotorFAQ;