const MainWhyUsArray = [
  {
    componentId: 1,
    header: 'Аналіз',
    text: "Ми ретельно аналізуємо ваші потреби та побажання, щоб зробити вироби, що точно задовольнять ваші вимоги.",
  },
  {
    componentId: 2,
    header: 'Проектування',
    text: "Моделювання проекту з розробкою конструкторської документації. Розрахунок вартості виробів та робіт.",
  },
  {
    componentId: 3,
    header: 'Виробництво',
    text: "Ми закуповуємо лише якісні матеріали та комплектуючі, щоб гарантувати надійність та довговічність наших виробів.",
  },
  {
    componentId: 4,
    header: 'Монтаж',
    text: "Наша команда професіоналів забезпечує доставку та монтаж на об'єкті, а також налаштування та програмування автоматики.",
  },
  {
    componentId: 5,
    header: 'Підтримка',
    text: "Ми завжди готові надавати сервісне супроводження та відповідати на ваші запитання після завершення проекту.",
  },
];

export default MainWhyUsArray;
