const MapArray = [
  {
    componentId: 1,
    header: 'Проработка',
    text: 'Проработка требований заказчика, анализ потребности и выбор наиболее оптимального решения',
  },
  {
    componentId: 2,
    header: 'Проектирование',
    text: 'Моделирование и проектирование проекта с разработкой конструкторской документации',
  },
  {
    componentId: 3,
    header: 'Производство',
    text: 'Закупка материалов и комплектующих и изготовления продукции',
  },
  {
    componentId: 4,
    header: 'Контрольная сборка',
    text: 'Контрольная сборка изделия, выявление и устранения недостатков',
  },
  {
    componentId: 5,
    header: 'Сервис',
    text: 'Шеф монтаж продукции и оказание сервисного сопровождения',
  },
];

export default MapArray;
