const MainWhyUsArray = [
  {
    componentId: 1,
    header: 'Опрацювання',
    text: 'Опрацювання вимог замовника, аналіз потреби та вибір найбільш оптимального рішення',
  },
  {
    componentId: 2,
    header: 'Проектування',
    text: 'Моделювання та проектування проекту з розробкою конструкторської документації',
  },
  {
    componentId: 3,
    header: 'Виробництво',
    text: 'Закупівля матеріалів та комплектуючих та виготовлення продукції',
  },
  {
    componentId: 4,
    header: 'Контрольна збірка',
    text: 'Контрольна збірка виробу, виявлення та усунення недоліків',
  },
  {
    componentId: 5,
    header: 'Сервіс',
    text: 'Шеф монтаж продукції та надання сервісного супроводу',
  },
];

export default MainWhyUsArray;
