
import { Box, } from '@mui/material';
import SectionTitle from '../../common/SectionTitle';

const types = [
  {
    image: '/images/p-gates/residential-gate.png',
    title: 'Гаражні ворота з пружинами розтягу',
    description: 'Перевірена часом класика - ворота з пружинами розтягу. Надійність та довговічність - ось наша гарантія. Відкрийте для себе широкий вибір стилів та кольорів для гармонійного поєднання з будь-яким дизайном.'
  },
  {
    image: '/images/p-gates/sectional-door.png',
    title: 'Побутові ворота з торсіоном',
    description: 'Забезпечте зручність та надійність для вашого дому з побутовими воротами з торсіонним механізмом. Насолоджуйтесь легкістю в управлінні та високою безпекою, завдяки інноваційним рішенням та технологіям.'
  },
  {
    image: '/images/p-gates/industrial-gate.png',
    title: 'Секційні промислові ворота',
    description: 'Робота з великими просторами потребує надійних інженерних рішень. Наші промислові ворота забезпечать ефективне управління логістикою та відмінний рівень безпеки. Відкрийте нові перспективи для вашого бізнесу!'
  }
];





const GatesGoods = () => {
  return (
    <Box>
      <SectionTitle title="Доступні гаражні" colored="секційні ворота" />

      
    </Box>
  );
};

export default GatesGoods;