export const blocksDataForGates = [
  {
    title: "Сучасні коричневі секційні ворота",
    firstDescription: "Відкрийте для себе наш вибір сучасних коричневих секційних воріт, що ідеально вписуються в будь-який стиль будівель. Створіть враження з першого погляду.",
    secondDescription: "З нами ви отримаєте надійні ворота з високоякісними панелями, що надають вашому приміщенню стильний і елегантний вигляд.",
    images: ["/images/p-gates/image1a.jpg", "/images/p-gates/image2a.jpg", "/images/p-gates/image3a.jpg", "/images/p-gates/image4a.jpg", "/images/p-gates/image5a.jpg"],
    alts: ["коричневі секційні ворота", "підготовка проєму під ворота", "ворота з коричневих панелей", "дизайн панелі дошка", "ворота центальний паз"]
  },
  {
    title: "Ефектні антрацитові секційні ворота",
    firstDescription: "Зверніть увагу на наші ворота в сучасному антрацитовому відтінку, які додають вашому будинку сучасний шарм та стиль. Підкресліть свою особистість.",
    secondDescription: "Наші антрацитові ворота виготовлені з вишуканих матеріалів, які гарантують найвищий рівень безпеки та комфорту.",
    images: ["/images/p-gates/image1b.jpg", "/images/p-gates/image2b.jpg", "/images/p-gates/image3b.jpg", "/images/p-gates/image4b.jpg", "/images/p-gates/image5b.jpg"],
    alts: ["антрацитові секційні ворота", "секційні ворота із середини гаража", "гаражні ворота додому", "модний колір воріт", "ворота в колір даху"]
  },
  {
    title: "Промислові ворота з високоякісними панелей",
    firstDescription: "Ознайомтеся з нашою колекцією промислових воріт сріблястого відтінку, які ідеально підійдуть для комерційних об'єктів. Покращте своє робоче середовище.",
    secondDescription: "Наші ворота виділяються надійною конструкцією та можливостями додаткової автоматизації, надаючи вам більше зручності.",
    images: ["/images/p-gates/image1c.jpg", "/images/p-gates/image2c.jpg", "/images/p-gates/image3c.jpg"],
    alts: ["промислові ворота зі срібним відтінком", "монтаж воріт на склад", "промислові ворота з цепним приводом"]
  },
  {
    title: "Стильні ворота з хвірткою для будь-якого підприємства",
    firstDescription: "Додайте елегантності та функціональності до вашого підприємства з нашими воротами з хвірткою, що створюють неперевершений образ.",
    secondDescription: "Ми пропонуємо ворота з різноманітними конфігураціями та можливостями налаштування, щоб задовольнити всі ваші потреби.",
    images: ["/images/p-gates/image1d.jpg", "/images/p-gates/image2d.jpg", "/images/p-gates/image3d.jpg", "/images/p-gates/image4d.jpg", "/images/p-gates/image5d.jpg"],
    alts: ["ворота з хвірткою", "проєм для промислових воріт", "ворота для підприємства", "калітка у воротах", "двоє секційних воріт"]
  }
  // Додайте дані для інших блоків тут
];

export const blocksDataForRollets = [
  {
    title: "Сучасні ролети для приватних будинків",
    firstDescription: "Оновіть свій будинок за допомогою сучасних ролет, які поєднують найвищий рівень захисту та естетичності. Зробіть свій будинок ще кращим.",
    secondDescription: "З різноманітним вибором кольорів і матеріалів, ви зможете знайти ролети, які ідеально впишуться у ваш інтер'єр.",
    images: ["/images/p-rolets/image1a.jpg", "/images/p-rolets/image2a.jpg" ],
    alts: ["вигляд на ролети зсередини кімнати", "сучасні ролети для приватних будинків" ]
  },
  {
    title: "Ефектні ролети для оформлення вікон",
    firstDescription: "Підкресліть своє віконне оформлення за допомогою ефектних ролет, які нададуть новий вигляд вашому інтер'єру та забезпечать контроль над освітленістю приміщення.",
    secondDescription: "Наші ролети виготовлені з високоякісних матеріалів, що гарантують тривалий термін служби та збереження якості в будь-якому середовищі.",
    images: ["/images/p-rolets/image1b.jpg", "/images/p-rolets/image2b.jpg", ],
    alts: ["срібна ролета на вікні", "ролети на другому поверсі" ]
  },  
];

export const blocksDataForMotors = [
  {
    title: "Roger Technology H30/640 - Ваш ідеальний вибір для автоматизації відкатних воріт",
    firstDescription: "Це передовий і надійний двигун, який відзначається високою продуктивністю та довговічністю. Цей продукт став вже давно справжньою класикою у світі монтажу автоматики для воріт.",
    secondDescription: "Roger H30/640 - це ідеальний вибір для тих, хто цінує комфорт і безпеку. Цей двигун вирізняється своєю надійністю і продуктивністю, забезпечуючи плавне і безшумне відкривання та закривання ваших воріт.",
    images: ["/images/p-motors/image1a.jpg", "/images/p-motors/image2a.jpg", "/images/p-motors/image3a.jpg", "/images/p-motors/image4a.jpg", "/images/p-motors/image5a.jpg"],
    alts: ["Roger H30/640", "надійний відкатний двигун", "підготовка фундаменту та проводки", "автоматизовані ", "класика відкатної автоматики"]
  },
  {
    title: "Розпашні автоматичні ворота - Зручність і безпека на вашому подвір'ї",
    firstDescription: "Їх легко відкривати та закривати, завдяки автоматизації, що працює на вас. Цей вид воріт надає вашій власності елегантний вигляд і захищає вас від небезпек та незваних гостей.",
    secondDescription: "Незалежно від того, чи це ваш дім, бізнес або будь-який інший об'єкт, розпашні автоматичні ворота роблять життя простішим і безпечнішим. Вони відкриваються однією натисканням кнопки і закриваються так само легко.",
    images: ["/images/p-motors/image1b.jpg", "/images/p-motors/image2b.jpg", "/images/p-motors/image3b.jpg", "/images/p-motors/image4b.jpg", "/images/p-motors/image5b.jpg"],
    alts: ["розпашні автоматичні ворота", "електроприводи телескопічні", "упори та засув для воріт", "розпашний електропривід", "автоматизація розпашних воріт"]
  },
  {
    title: "Nice Home Filo 600 KIT - Завжди в безпеці і комфорті",
    firstDescription: "Це передовий комплект автоматики для відкатних воріт, який забезпечує вас комфортом і безпекою. Цей продукт розроблений для використання на воротах зі стулкою вагою до 600 кг і довжиною до 7 метрів.",
    secondDescription: "Nice Home Filo 600 KIT забезпечує повний контроль над вашими воротами і гарантує їх безперебійну роботу. Великий діапазон робочих температур, що робить його ідеальним для різних кліматичних умов.",
    images: ["/images/p-motors/image1c.jpg", "/images/p-motors/image2c.jpg", "/images/p-motors/image3c.jpg", "/images/p-motors/image4c.jpg"],
    alts: ["відкатний Nice Home", "Filo 600 KIT", "фотоелементи Nice Home", "автоматика Filo 600"]
  },
  {
    title: "Швидкісні, інтенсивні шлагбауми",
    firstDescription: "Це надійне та ефективне рішення для котеджних містечок і таунхаусів. Ці шлагбауми розроблені для тих, хто цінує зручність та безпеку у в'їзді на свою територію. Вони працюють надійно у будь-яких погодних умовах і забезпечують довгий термін служби.",
    secondDescription: "Вони можуть працювати в швидкісному режимі, навіть при інтенсивному русі автотранспорту. Це зробить в'їзд на вашу територію максимально зручним та безпечним для всіх мешканців.",
    images: ["/images/p-motors/image1d.jpg", "/images/p-motors/image2d.jpg", "/images/p-motors/image3d.jpg", "/images/p-motors/image4d.jpg"],
    alts: ["шлагбаум в котеджне містечко", "швидкісний бар'єр", "шлагбаум для таунхаусів", "інтенсивний шлагбаум"]
  },
];
