export const blocksDataForPage1 = [
    {
      title: "Сучасні коричневі секційні ворота",
      firstDescription: "...",
      secondDescription: "...",
      images: [...],
      alts: [...]
    },
    // Додайте дані для інших блоків тут
  ];
  
  export const blocksDataForPage2 = [
    // Дані для іншої сторінки
  ];
  
  export const blocksDataForPage3 = [
    // Дані для третьої сторінки
  ];

 // тут дані для кожного блоку
 const blockAData = {
    title: "Сучасні коричневі секційні ворота",
    firstDescription: "Дивіться наш вибір сучасних коричневих секційних воріт, що відмінно вписуються в будь-який стиль будівель.",
    secondDescription: "З нами ви отримаєте надійні ворота з якісними панелями, які виглядають стильно та елегантно.",
    images: ["/images/p-gates/image1a.jpg", "/images/p-gates/image2a.jpg", "/images/p-gates/image3a.jpg"],
    alts: ["коричневі ворота", "підготовка проєму під ворота", "ворота з коричневих панелей"]
};
const blockBData = {
  title: "Ефектні антрацитові секційні ворота",
  firstDescription: "Приділіть увагу нашим воротам у сучасному антрацитовому відтінку, які додають вашій власній домівці сучасність та стиль.",
  secondDescription: "Наші антрацитові ворота виготовлені з найкращих матеріалів та забезпечують найвищий рівень безпеки та зручності.",
  images: ["/images/p-gates/image1b.jpg", "/images/p-gates/image2b.jpg", "/images/p-gates/image3b.jpg"],
  alts: ["ворота антрацит дошка", "секційні ворота із середини гаража", "гаражні ворота додому"]
};
const blockCData = {
  title: "Промислові ворота з високоякісних панелей",
  firstDescription: "Ознайомтеся з нашою колекцією промислових воріт зі сріблястим відтінком, які ідеально підійдуть для комерційних приміщень.",
  secondDescription: "Наші ворота відзначаються надійною конструкцією та можливостями додаткової автоматизації для вашої зручності.",
  images: ["/images/p-gates/image1c.jpg", "/images/p-gates/image2c.jpg", "/images/p-gates/image3c.jpg"],
  alts: ["ворота з панелей срібло", "монтаж воріт на склад", "промислові ворота з цепним приводом"]
};
const blockDData = {
  title: "Стильні ворота з хвірткою для будь-якого підприємства",
  firstDescription: "Додайте елегантності та функціональності до вашого підприємства з нашими воротами з хвірткою, що виглядають неймовірно.",
  secondDescription: "Ми пропонуємо ворота з різними конфігураціями та можливостями налаштування, щоб задовольнити ваші потреби.",
  images: ["/images/p-gates/image1d.jpg", "/images/p-gates/image2d.jpg", "/images/p-gates/image3d.jpg"],
  alts: ["ворота із хвірткою", "проєм для промислових воріт", "ворота на підприємство"]
};
